# SolidGlass Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidGlass Class
Members See Also
---
A static class that provides access to the property names that appear in the SolidGlass visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class SolidGlass
```

Visual Basic
---
```text
Public NotInheritable Class SolidGlass
```

Visual C++
---
```text
public ref class SolidGlass abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..SolidGlass
# See Also
SolidGlass Members
Autodesk.Revit.DB.Visual Namespace